{
  "Specialis Revelio": " Causes an object to show its hidden secrets or magical properties.",
  "Engorgio": " Causes objects to swell in size.",
  "(Switching Spell)": " Causes two objects to be switched for one another.",
  "Densaugeo": " Causes the teeth of the recipient to grow at an alarming rate.",
  "(Freezing Charm)": " Renders target immobile.",
  "(Hover Charm)": " An object is levitated off the ground and moved according to the caster. See ",
  "Confringo": " Causes anything that the spell meets to explode in flames.",
  "Aparecium": " This spell makes ",
  "(Gripping Charm)": " Used to help someone grip something with more effectiveness. This charm is placed upon Quaffles to help Chasers carry the Quaffle whilst simultaneously holding their brooms.",
  "(Unbreakable Charm)": " Causes an object to become unbreakable.",
  "Point Me": " Causes the caster's wand tip to point to the north cardinal point, acting like a ",
  "(Anti-Cheating Spell)": " Cast on parchment or quills to prevent the writer from cheating whilst writing answers.",
  "Piertotum Locomotor": " Spell used to animate statues and suits of armour to do the caster's bidding.",
  "Oppugno": " Causes conjured objects to attack.",
  "Cave Inimicum": " Spell used to strengthen an enclosure from enemies.",
  "Homenum Revelio": " Reveals humans near the caster.",
  "(Jelly-Fingers Curse)": " Causes the target's fingers to become almost jelly-like to make it impossible for the victim to grasp objects. If the opponent touches a wall, he/she will be stuck to it forever.",
  "Serpensortia": " Conjures a serpent from the spell caster's wand.",
  "Obscuro": " Causes a blindfold to appear over the victim's eyes, obstructing his/her view of his/her surroundings.",
  "Evanesco": " Makes the target vanish.",
  "Alohomora": " Used to open and/or unlock doors,",
  "(Protean Charm)": " Causes copies of an object to be remotely affected by changes made to the original.",
  "(Trip Jinx)": " Causes the victim of the jinx to trip and fall.",
  "Morsmordre": " Conjures the ",
  "Episkey": " Used to heal relatively minor injuries. When this spell is cast, the person feels his/her injured body part go very hot and then very cold.",
  "(Gemino Curse)": " Whenever an object affected by this curse is touched, it duplicates itself into many useless copies to hide the original. To add confusion and eventually fill the surrounding area with copies, the copies also duplicate.",
  "(Disillusionment Charm)": " Causes the target to become invisible, or close to it.",
  "(Refilling Charm)": " Refills whatever at which the caster points with the drink originally in the container.",
  "Petrificus Totalus": " Used to temporarily bind the victim's body in a position much like that of a soldier at attention; this spell does not restrict breathing or seeing, and the victim will usually fall to the ground.",
  "(Homorphus Charm)": " Causes an ",
  "(Knee-Reversal Hex)": " Causes the victim's knees to appear on the opposite side of his/her legs.",
  "(Intruder Charm)": " Detects intruders and sounds an alarm.",
  "Geminio": " Creates a duplicate of any object upon which it is cast. As revealed by the goblin Griphook, any copies created are worthless. The duplicate lasts several hours. Magical properties, at least of a Horcrux, are not copied.",
  "(Hair-Thickening Charm)": " Thickens one's hair.",
  "Riddikulus": " A spell used when fighting a ",
  "Deprimo": " A very powerful wind that can loosen and/or soften a variety of things; it can also be used to detach objects.",
  "(Hair Loss Curse)": " Causes one to lose one's hair.",
  "Incarcerous": " Ties someone or something up with ropes.",
  "Expulso": " A spell that causes an object to explode. The force of the explosion may depend on the intent of the caster.",
  "Erecto": " Used to erect something.",
  "(Colour-Change Charm)": " Changes an object's colour.",
  "(Conjunctivitus Curse)": " A curse that causes great pain to the victim's eyes.",
  "(Bubble-Head Charm)": " Puts a large bubble of air around the head of the user. Used as a magical equivalent of a ",
  "(Jelly-Legs Jinx)": " A jinx that renders its victim's legs temporarily useless, leaving him/her to wobble around helplessly until the effect wears off or the counter-jinx is performed.",
  "Relashio": " A charm used to force someone or something to release that which it holds or grapples by means of shooting fiery sparks out or, underwater, shooting hot bursts of water.",
  "Flipendo": " Used to send an enemy flying or flipping through the air.",
  "Salvio Hexia": " Provides some form of protection against hexes.",
  "(Unbreakable Vow)": " Causes a vow taken by a witch or wizard to be inviolable; if he or she should break it, the consequence is death. It manifests itself as interlinking chains of fire binding the clasped hands of the people taking the Vow; the fire shoots out as a tongue of flame from the wand of the Binder (a witness to the Vow) every time the person who takes the vow makes a promise. The flames then form into the linking chains. According to Ron Weasley, the spell causes death to anyone who breaks the vow.",
  "Lumos": " Creates a narrow beam of light that shines from the wand's tip, like a ",
  "Finite Incantatem": " Negates many spells or the effects of many spells.",
  "Waddiwasi": " Appears to launch small objects through the air.",
  "(Imperturbable Charm)": " Makes objects such as doors impenetrable (by everything, including sounds and objects).",
  "Flagrate": " With this spell, the caster's wand can leave fiery marks.",
  "Obliviate": " Used to hide a memory of a particular event.",
  "Expecto Patronum": " Conjures an ",
  "(Tongue-Tying Curse)": " A curse that prevents certain information from being revealed by the individual upon whom the spell is placed. The curse manifests itself by causing the tongue to temporarily curl backwards upon itself.",
  "(Stealth Sensoring Spell)": " Detects those under magical disguise.",
  "(Babbling Curse)": " The Babbling Curse is presumed to cause a person to babble whenever they try to speak.",
  "Protego Totalum": " Provides protection of some form for an area or dwelling.",
  "Stupefy": " Puts the victim in an unconscious state. Manifests as a jet of red light.",
  "(Slug-Vomiting Charm)": " A jet of green light strikes the victim, who then vomits slugs for an undefined period of time (greater than five hours). The sizes of the vomited slugs decrease with time.",
  "Deletrius": " Removes or dismisses the effect of ",
  "(Obliteration Charm)": " Removes things not wished to be seen again.",
  "(Fiendfyre Curse)": " Dangerous, hard to control and extremely powerful cursed fire which can take the form of beasts such as ",
  "Locomotor": " The spell is always used with the name of a target, at which the wand is pointed (e.g. \"",
  "Pack": " Packs a trunk, or perhaps any luggage.",
  "Muffliato": " Keeps nearby people, or those to whom the wand is directed, from hearing nearby conversations.",
  "Rictusempra": " The subject experiences the sensation of being ",
  "Impervius": " This spell makes something repel (literally, become impervious to) substances and outside forces, including water.",
  "Impedimenta": " This powerful spell is capable of tripping, freezing, binding, knocking back and generally impeding the target's progress towards the caster. The extent to which the spell's specific action can be controlled by the caster is not made clear. If this spell does bind, it does eventually wear off as stated in ",
  "Scourgify": " Used to clean something.",
  "Colloportus": " Magically locks a door, preventing it from being opened by Muggle means.",
  "(Supersensory Charm)": " Able to possess superior senses than before.",
  "Anapneo": " Clears the target's airway, if blocked.",
  "Reparo": " Used to repair broken or damaged objects.",
  "Mobiliarbus": " Lifts a tree a few inches off the ground and levitates it to where the caster points his or her wand.",
  "Defodio": " Can carve or dig out materials, such as stone and steel.",
  "Tarantallegra": " Makes victim's legs dance uncontrollably, so the victim cannot control his or her movements (recalling the ",
  "Locomotor Mortis": " Locks the legs together, preventing the victim from moving the legs in any fashion. The target can hop when affected by this curse, but walking is impossible without the countercurse",
  "Reducto": " Enables the caster to explode solid objects.",
  "Protego Horribilis": " Provides some form of protection against Dark Magic.",
  "Expelliarmus": " This spell is used to disarm another wizard, typically by causing the victim's wand to fly out of reach.",
  "(Entrail-Expelling Curse)": " Presumably causes the ",
  "(Flying Charm)": " Cast on ",
  "Repello Muggletum": " Keeps ",
  "Tergeo": " Siphons material from a surface, (e.g., blood, ink, dust, etc.)",
  "Emancipare": " Countercurse to ",
  "Imperio": " Causes the victim of the curse to obey the spoken/unspoken commands of the caster. The experience of being controlled by this curse is described as a complete, wonderful release from any sense of responsibility or worry over one's actions, at the price of one's free will. Resisting the effect of the curse is possible, however, and several individuals have been able to successfully overcome it, including Harry and both of the Crouches, who learn to resist the curse after being subjected to its effects for an extended period. Harry describes the feeling of being the caster as controlling a marionette through a wand (although Harry's particular experience is suspect due to his lack of commitment to casting Unforgivable Curses). One of the three ",
  "Nox": " Counter charm to the ",
  "Rennervate": " Brings someone out of unconsciousness.",
  "(Caterwauling Charm)": " Anyone entering the perimeter of a Caterwauling Charm sets off a high-pitched shriek.",
  "(Taboo)": " A jinx which may be placed upon a word or a name, so that whenever that word is spoken, a magical disturbance is created that alerts the caster of the Taboo to the location of the speaker. Any protective enchantments in effect around the speaker are broken when the Tabooed word is spoken aloud.",
  "Meteolojinx Recanto": " Causes weather effects caused by incantations to cease.",
  "Accio": " This charm summons an object to the caster, potentially over a significant distance.",
  "Descendo": " Makes things sink, or go down.",
  "(Permanent Sticking Charm)": " Makes objects permanently stay in place.",
  "(Fidelius Charm)": " A charm involving secret information hidden within the soul of a ",
  "Orchideous": " Makes a bouquet of flowers appear out of the caster's wand.",
  "Reducio": " Makes an enlarged object smaller. Counter-charm to ",
  "Legilimens": " Allows the caster to delve into the mind of the victim, allowing the caster to see the memories, thoughts, and emotions of the victim.",
  "Avada Kedavra": " Causes instant, painless death to whomever the curse hits. There is no countercurse or method of blocking this spell; however, if someone sacrifices their life for someone else, the person who was saved will not encounter any adverse effects of any curses by the specific attacker (e.g. when Lily Potter sacrificed her life for Harry Potter at Voldemort's hands, Harry became immune to curses cast by Voldemort). One of the three Unforgivable Curses.",
  "(Invisibility Charm)": " Renders the object or person invisible.",
  "Mobilicorpus": " Lifts a body a few inches off the ground and levitates it where the caster points his or her wand",
  "Aguamenti": " Produces a jet of water from the caster's wand.",
  "Sonorus": " Magnifies the spell caster's voice, functioning as a magical ",
  "(Bat-Bogey Hex)": " Grotesquely enlarges the target's bogeys, gives them wings, and sets them attacking the target.",
  "Confundo": " Causes the victim to become confused, befuddled, overly forgetful and prone to follow simple orders without thinking about them.",
  "Fulgari": " Binds the hands with shining cords.",
  "Liberacorpus": " The counter spell to ",
  "(Placement Charm)": " A charm which temporarily places an object upon a desired target.",
  "Crucio": " Inflicts unbearable pain on the recipient of the curse.",
  "Glisseo": " Causes the steps on a stairway to flatten and form a ramp or slide.",
  "Capacious Extremis": " Causes a container's capacity to be increased, without changing the object's external appearance or its weight noticeably. The container may be carried or used as normal. Known as the ",
  "Avis": " This charm creates a flock of birds from the caster's wand. When coupled with ",
  "(Hot-Air Charm)": " Causes wand to emit hot air.",
  "(Horton-Keitch Braking Charm)": " This spell was first used on the Comet 140 to prevent players from overshooting the goal posts and from flying off-sides.",
  "Portus": " Turns an object into a ",
  "Furnunculus": " Causes the target to become covered in boils.",
  "(Jelly-Brain Jinx)": " Presumably affects the target's mental processes.",
  "(Bedazzling Hex)": " Similar to a ",
  "Levicorpus": " The victim is dangled upside-down by one of his/her ankles, sometimes accompanied by a flash of white light.",
  "Quietus": " Makes a magically magnified voice return to normal.",
  "Incendio": " Produces fire.",
  "(Repelling Charm)": " Pushes a moving object away from an invisible barrier.",
  "(Hurling Hex)": " Causes brooms to vibrate violently in the air and try to buck their rider off.",
  "Langlock": " Glues the victim's tongue to the roof of his/her mouth. Created by Severus Snape.",
  "Brachiabindo": " Binds the limbs tightly. Countercurse is ",
  "Sectumsempra": " Violently wounds the target; described as being as though the subject had been \"slashed by a sword\".",
  "Diffindo": " Cuts or rips objects.",
  "Ferula": " Creates a bandage and a splint.",
  "Protego": " The Shield Charm",
  "Silencio": " Silences something immediately",
  "(Stinging Hex/Stinging Jinx)": " Produces a stinging sensation in the victim, resulting in angry red welts and occasionally the severe inflammation of the affected area.",
  "Duro": " Makes the object hard.",
  "(Banishing Charm)": " Opposite to \"",
  "Prior Incantato": " Causes the echo (a shadow or image) of the last spell cast by a wand to emanate from it.",
  "(Flame-Freezing Charm)": " Causes fire to become harmless to those caught in it, creating only a gentle, tickling sensation instead of burns.",
  "(Age Line Spell)": " Creates a thin, shimmering line that can only be passed by people of a set age. Aging potions are useless against age lines. Incantation unknown. As demonstrated by Fred and George Weasley, attempting to use an aging potion and stepping over the line appears to work, but moments later they are seen with grey hair and beards. It is unknown whether the ageing potion causes this alongside the age line spell.",
  "Molliare": " Cushions the body in event of a fall.",
  "(Anti-Disapparition Jinx)": " Used to prevent ",
  "(Cheering Charm)": " Causes the person upon whom the spell was cast to become happy and contented, though heavy-handedness with the spell may cause the person to break into an uncontrollable laughing fit."
}